### NYC MTA

We'll be looking at how to cut budget costs for the police department in this program. Market research studies can be used to supplement data findings.

First 3 months of 2020

In [18]:
import pandas as pd

In [19]:
# Source: http://web.mta.info/developers/turnstile.html

def get_data(week_nums):
    url = "http://web.mta.info/developers/data/nyct/turnstile/turnstile_{}.txt"
    dfs = []
    for week_num in week_nums:
        file_url = url.format(week_num)
        dfs.append(pd.read_csv(file_url))
    return pd.concat(dfs)

In [73]:
#every saturday week num starts
#year , month, day


week_nums = [200620] #200104, 200111, 200118, 
turnstiles_df = get_data(week_nums)

In [74]:
turnstiles_df.shape

(206739, 11)

In [47]:
turnstiles_df.head()

,C/A,UNIT,SCP,STATION,LINENAME,DIVISION,DATE,TIME,DESC,ENTRIES,EXITS
0,A002,R051,02-00-00,59 ST,NQR456W,BMT,01/11/2020,03:00:00,REGULAR,7339607,2487888
1,A002,R051,02-00-00,59 ST,NQR456W,BMT,01/11/2020,07:00:00,REGULAR,7339623,2487900
2,A002,R051,02-00-00,59 ST,NQR456W,BMT,01/11/2020,11:00:00,REGULAR,7339713,2487980
3,A002,R051,02-00-00,59 ST,NQR456W,BMT,01/11/2020,15:00:00,REGULAR,7339933,2488044
4,A002,R051,02-00-00,59 ST,NQR456W,BMT,01/11/2020,19:00:00,REGULAR,7340289,2488104

In [11]:
turnstiles_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 580895 entries, 0 to 192877
Data columns (total 11 columns):
 #   Column                                                                Non-Null Count   Dtype
---  ------                                                                --------------   -----
 0   C/A                                                                   580895 non-null  object
 1   UNIT                                                                  580895 non-null  object
 2   SCP                                                                   580895 non-null  object
 3   STATION                                                               580895 non-null  object
 4   LINENAME                                                              580895 non-null  object
 5   DIVISION                                                              580895 non-null  object
 6   DATE                                                                  580895 non-null  object
 7   TIME                                                                  580895 non-null  object
 8   DESC                                                                  580895 non-null  object
 9   ENTRIES                                                               580895 non-null  int64
 10  EXITS                                                                 580895 non-null  int64
dtypes: int64(2), object(9)
memory usage: 53.2+ MB

In [75]:
by_station = turnstiles_df.groupby('STATION')

In [76]:
of_each = by_station.sum()
of_each

,ENTRIES,EXITS
STATION,,
1 AV,19365450333,19715046983
103 ST,5670763830,4944705058
103 ST-CORONA,2614707334,2672927596
104 ST,71040586187,41574514624
110 ST,1709226373,1634057741
...,...,...
WOODLAWN,1357361781,520750026
WORLD TRADE CTR,67267142628,77449223444
WTC-CORTLANDT,30969872564,198920947
YORK ST,1922304461,1515235556
ZEREGA AV,107074828,65808733

In [84]:
of_each.columns

Index(['ENTRIES', 'EXITS                                                               '], dtype='object')

In [85]:
#Multiple exits may 

of_each.sort_values(by=['EXITS                                                               '], ascending=False)

,ENTRIES,EXITS
STATION,,
42 ST-PORT AUTH,316357017191,261627386809
161/YANKEE STAD,255283859623,246151088066
23 ST,242135885629,243475319133
34 ST-HERALD SQ,188049683218,241289804497
CANAL ST,169868511062,228423205182
...,...,...
NEWARK BM BW,96528736,7491539
NEWARK C,48958624,6247972
TOMPKINSVILLE,104938814,2934834
ORCHARD BEACH,20788740,1336909
RIT-MANHATTAN,48270826,829389

compare top with MTA's top
find outliers & way to address them
grouping by stations issues

time series chunk into hours 
rush hour time frames

what stations are used at what time